In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv('weight-height.csv')

In [3]:
data.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Gender  10000 non-null  object
 1   Height  10000 non-null  float64
 2   Weight  10000 non-null  float64
dtypes: float64(2), object(1)
memory usage: 234.5+ KB

In [7]:
data.shape

(10000, 3)

In [8]:
data.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [9]:
data.isnull()

      Gender  Height  Weight
0      False   False   False
1      False   False   False
2      False   False   False
3      False   False   False
4      False   False   False
...      ...     ...     ...
9995   False   False   False
9996   False   False   False
9997   False   False   False
9998   False   False   False
9999   False   False   False

[10000 rows x 3 columns]

In [10]:
# sorting the height values in an ascending order
data.sort_values('Height')

      Gender     Height      Weight
9285  Female  54.263133   64.700127
6624  Female  54.616858   71.393749
7294  Female  54.873728   78.606670
7617  Female  55.148557   88.812412
5345  Female  55.336492   88.366583
...      ...        ...         ...
994     Male  78.095867  255.690835
1317    Male  78.462053  227.342565
3285    Male  78.528210  253.889004
3757    Male  78.621374  245.733783
2014    Male  78.998742  269.989699

[10000 rows x 3 columns]

In [11]:
# sorting the weight values in ascending order
data.sort_values('Weight')

      Gender     Height      Weight
9285  Female  54.263133   64.700127
5360  Female  55.668202   68.982530
6624  Female  54.616858   71.393749
9566  Female  57.353093   72.750145
7935  Female  58.211650   77.523774
...      ...        ...         ...
3285    Male  78.528210  253.889004
4331    Male  76.848761  254.209073
994     Male  78.095867  255.690835
1610    Male  76.617546  255.863326
2014    Male  78.998742  269.989699

[10000 rows x 3 columns]

In [12]:
# removing the rows with empty cells
data.dropna()

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [13]:
# removing duplicates in the dataset
data.drop_duplicates()

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]